Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElements Property
 Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoRoomBoundingElements { get; }
Visual Basic
Public Shared ReadOnly Property NoRoomBoundingElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoRoomBoundingElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace